# CannotRemoveSubordFromGroupWarn Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..CannotRemoveSubordFromGroupWarn Property
BuiltInFailures..::..GroupFailures Class See Also
---
Element can't be removed or excluded from the Group because it is required by another Group element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotRemoveSubordFromGroupWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotRemoveSubordFromGroupWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotRemoveSubordFromGroupWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace